export default {
  nav: Object.freeze({
    home: '首页',
    about: '个人',
    works: '作品',
    blog: '博客',
    album: '相册'
  }),
  aiKeys: Object.freeze({
    help: /^(帮助|help|-h|-?[?？]|查看指令)$/,
    clear: /^(cls|clear|清除|清屏)$/,
    song: /^听\s+/,
    songPause: /^((-m|music)\s+off|暂停音乐|安静|嘘|静音)\s*$/,
    songPlay: /^((-m|music)\s+on|播放(音乐|歌曲))\s*$/,
    songLoop: /^((-m|music)\s+loop|单曲循环)\s+$/,
    songNum: /^\d+$/,
    songList: /^((-m|music)\s+list|查看歌单|歌单|歌曲列表)\s*$/,
    songName: /^((-m|music)\s+(name|song)|(查看)?歌名)\s*$/
  }),
  help () {
    let html = '<div class="command-answer-title">访问页面：</div><div class="command-answer-detail fs8">'
    for (let k in this.nav) {
      if (k === 'home') continue
      html += '<span class="command-fc0">访问' + this.nav[k] + '</span>：可输入的指令有“' + this.nav[k] + '”、“' + k + '”<br>'
    }
    html += `</div>
      <div class="command-answer-title">听音乐：</div>
      <div class="command-answer-detail fs8">
        <span class="command-fc0">听歌搜歌</span>：可输入“听 + 空格 + 关键词（歌曲或歌星）”，如：听 蓝莲花，又如：听 许巍<br/>
        <span class="command-fc0">暂停音乐</span>：可输入指令有“-m off”、“music off”、“暂停音乐”、“安静”、“嘘”、“静音”<br/>
        <span class="command-fc0">播放音乐</span>：可输入指令有“-m on”、“music on”、“播放音乐”、“播放歌曲”<br/>
        <span class="command-fc0">单曲循环</span>：可输入指令有“-m loop”、“music loop”、“单曲循环”，注：关闭单曲循环同用<br/>
        <span class="command-fc0">查看歌单</span>：可输入指令有“-m list”、“music list”、“歌单”、“歌曲列表”，注：列出的只是上一次的搜索结果<br/>
        <span class="command-fc0">查看歌名</span>：可输入指令有“-m name”、“music name”、“歌名”、“查看歌名”
      </div>
      <div class="command-answer-title">其他指令：</div>
      <div class="command-answer-detail fs8">
        <span class="command-fc0">查看指令</span>：可输入指令有“？”、“-h”、“help”、“帮助”、“查看指令”<br/>
        <span class="command-fc0">清空屏幕</span>：可输入指令有“cls”、“clear”、“清屏”、“清除”
      </div>
      <div class="command-answer-title">问答系统：</div>
      <div class="command-answer-detail fs8">
        以上指令之外的事情，都交给本问答系统吧。当前系统只是个非常小的静态数据，纯属娱乐同时装一下X，能回复的问题不多，而且态度基本很傲娇，很皮。
        以后，砸家想开发为一个具有人工智能的问答学习系统，不仅会回答码农的问题，还会回答九年义务教育的课程问题甚至各行业的专业问题。期待吧~
      </div>`
    return html
  },
  AI: Object.freeze([{
    ask: /个人(基本)?信息|(个人|自我)介绍|介绍(一下)?你?自己/,
    answer: [`姓名：晋曲<br/>出生：88年<br/>籍贯：贵州<br/>专业：园林<br/>学历：本科<br/>学位：农学学士<br/>毕业院校：嘉应大学<br/>毕业时间：2012年<br/>
      个人技能：请输入“个人”或“about”进入了解<br/>兴趣爱好：非常广泛，只是这几年全部时间投入学习代码，无暇顾及<br/>业余特长：吉他、绘画、写作、篮球<br/>
      性格特征：本人性格属于沉静、平稳、温和、不浮躁类型，同时也略带风趣。上进心极强，好奇心极重，喜欢深研、探索新知识。
      另外，“专注”和“耐心”是大多学人给我最多的评价词，我自认为“专注”最适合我，“耐心”在我这里应该理解为“克服”，“专注”和“克服”共同合成了学习（工作本身也是学习）的
      一把利剑，遇到难题时“不服”的斗志就上来甚至上头，而大多数人可能选择“中场休息”或“转移目标”或“中断前进”，相比之下，我这种态度绝对是积极向上的青年标杆(*^__^*)，
      敢与芸芸小年轻PK。试问，有多少与我同龄或像我一样毕业之后依然保持着高强度不止的学习步伐，极少也。`]
  }, {
    ask: /(擅长|会)什么|项目(经历|经验)/,
    answer: ['目测你是想了解我的基本信息，输入“个人”进入个人页面吧']
  }, {
    ask: /早|(早上|晚上|你|中午|下午)\s*[好早]/i,
    answer: ['嗯', '嗯嗯', '你好，too']
  }, {
    ask: /(这是?)*(怎么|如何|咋个?)[做作]到?的/,
    answer: ['一切都是transform，了解一下']
  }, {
    ask: /(怎么|如何|咋个)称呼|[你您]?叫什么|报上名来|姓[啥甚]?名[啥甚]?|[你您]?的?(真名|名字)|你是[?？谁]/,
    answer: ['小曲', '你猜', '晋曲', '令狐长老', '这不重要', 'Rudy']
  }, {
    ask: /男[的生人]女[的生人]|是男是女|性别|你是[女男](的|生|孩子?|人)吗/,
    answer: ['我是大叔', '为什么会问这么傻的问题？', '男人', 'Boy', 'Man', 'Young man', '你不会是来找茬的吧？']
  }, {
    ask: /[喝呵][,，]?([男女]人|基[佬老])$|基[佬老]$/,
    answer: ['呵，垃圾', '呵，二狗', '呵，基佬']
  }, {
    ask: /(如何|怎么?样?|咋个)(操作|进[入去]|访问)/,
    answer: ['输入“帮助”看看正确指令', '憨，不会看上面提示输入“帮助”吗？']
  }, {
    ask: /(如何|怎么?样?|咋个)(复制|选[择中取](文字|内容))/,
    answer: ['按住ctrl，然后就可以鼠标左键选文字了，之后该干嘛干嘛']
  }, {
    ask: /(如何|怎么?样?|咋个?)(学好|提高|学习|提升|加强)(代码|js|jquery|javascript|鸡儿屎|前端|后台|ajax|数据|SEO)*/i,
    answer: ['其实很简单，就两步：<br>第一步：早上5点左右起床写代码，<br>第二步：晚上12点还在写代码', '这个问题充钱就能解决']
  }, {
    ask: /[说]?我[\s\S]*?(厉害|腻害|牛[逼BX13]|帅)/i,
    answer: ['喝嘤料', '呵呵', '三连否', '拒绝']
  }, {
    ask: /(大叔|你|Rudy|令狐长老|大神)?[\s\S]*?(厉害|腻害|牛(逼|B|X|13)|帅|优秀)/i,
    answer: ['这谁都知道', '假装谦虚', '低调', '天生的']
  }, {
    ask: /我(太|好|真(.{2})?|怎么|为何|咋个?|为啥)(这么)*傻[了吧?？]?/i,
    answer: ['关我什么四？', '天生的', '未解之谜']
  }, {
    ask: /(大叔|你|Rudy|令狐长老|大神)?[\s\S]*傻(逼|B|13|X)/i,
    answer: ['系统怀疑素质有问题', '你可能是个傻憨龊笨']
  }, {
    ask: /你是?(怎么|如何|咋个?)[做作]到的/i,
    answer: ['给钱我就说', '你猜']
  }, {
    ask: /然后呢?/,
    answer: ['没有然后', '然后就没有然后了']
  }, {
    ask: /(大叔|你|Rudy|令狐长老|大神)*.*?(几点|什么时候)[睡起]/i,
    answer: ['比狗睡得晚，比鸡起得早', '总之比你们这些鸡狗早起晚睡']
  }, {
    ask: /(睡觉|下班|吃饭|要饭)了?/,
    answer: ['呵，快滚', '呵嘤料', '还早']
  }, {
    ask: /加班[吗吧啊?？]/,
    answer: ['不加', '打死也不加']
  }, {
    ask: /加班(,好气|$)/,
    answer: ['奈斯', '关我什么四']
  }, {
    ask: /^好气$/,
    answer: ['气个P标签', '关我什么四']
  }, {
    ask: /^(好的?|ok|嗯嗯?|谢谢?|知道了?|明白|晓得|了解|真的吗?|你?确定[?？]?)/i,
    answer: ['嗯', '哦', '喔']
  }, {
    ask: /(爱上?|喜欢|中意)你/,
    answer: ['那你给我钱吧', '可惜我只缺钱']
  }, {
    ask: /爱我[吗吧?？]*/,
    answer: ['呵，可能吗？除非打死我', '呵，可能吗？']
  }, {
    ask: /^(大叔|你|Rudy|令狐(长老)*|大神|长老)$|((大叔|你|Rudy|令狐(长老)*|大神|长老)*在[吗吧啊?？]*)/,
    answer: ['嗯哼', '哦嚯', '喝嘤料', '不在']
  }])
}
